[
  {
    "Text": "Eine Stadtverwaltung möchte alle ressortübergreifenden Projekte in einer Datenbank erfassen. Jedem Projekt muss ein Mitarbeiter zugeordnet werden, der das Projekt leitet. Mitarbeiter können zeitgleich oder im Laufe der Zeit verschiedene Projekte leiten. Außerdem sollen einem Projekt Mitarbeiter zugewiesen werden könnnen, die an dem Projekt mitarbeiten sollen. Dies muss jedoch nicht bereits bei der Neuanlage eines Projekts erfolgen. Mitarbeiter können zeitgleich oder im Laufe der Zeit an verschiedenen Projekten mitarbeiten. Für alle beteiligten Mitarbeiter muss außerdem das Ressort angegeben sein, in dem sie arbeiten. Für jedes Projekt sollen die Projektbezeichnung, eine Kurzbeschreibung, das Start- und das Abschlussdatum, der Projektleiter sowie alle weiteren Projektmitarbeiter verfügbar sein. Für jeden Mitarbeiter sollen Personalnummer, Vor- und Nachname sowie das Ressort, in dem er arbeitet, verfügbar sein. Für jedes Ressort soll dessen Bezeichnung gespeichert werden können. In der Datenbank sollen alle Ressorts der Stadt verfügbar sein, auch wenn ein Ressort bisher noch keinen Mitarbeiter für ein solches Projekt abgestellt hat.",
    "Sprache": "de",
    "keywords": [
      {
        "Wort": "projekt",
        "Gewicht": 0.3569553284105879
      },
      {
        "Wort": "mitarbeiter",
        "Gewicht": 0.30476655400966124
      },
      {
        "Wort": "alle",
        "Gewicht": 0.268509576928626
      }
    ]
  },
  {
    "Text": "Vom Kunden: KFZ-Kennzeichen, Kilometerstand; ist der Kunde zum ersten Male da, wird der Name, Vorname, Adresse, Telnr erfasst Von der Rechnung: Beim Abholen des Autos bekommt der Kunde eine Rechnung mit folgenden Daten: Einzelteile, Anzahl der Einzelteile, Beschreibung der Arbeiten, Angaben zum Auto wie Marke, PS, usw.; eine Rechnungsummer(wird vergeben) und das Auftragsdatum!",
    "Sprache": "de",
    "keywords": [
      {
        "Wort": "der",
        "Gewicht": 0.38106504545627023
      },
      {
        "Wort": "einzelteile",
        "Gewicht": 0.2921369846810226
      },
      {
        "Wort": "rechnung",
        "Gewicht": 0.2921369846810226
      }
    ]
  },
  {
    "Text": "Eine Autovermietung besitzt viele verschiedene Automodelle. Jedes Automodell kann durch das Schlüsselattribut „Modellnummer“ eindeutig identifiziert werden. Zu jedem Modell gehört eine Vielzahl an tatsächlichen Autos. Einem Auto ist genau ein RFID-Chip zugeordnet. Um den RFID-Chip eindeutig zu identifizieren benötigt man die Frequenz und den RFID-Code.",
    "Sprache": "de",
    "keywords": [
      {
        "Wort": "rfid",
        "Gewicht": 0.4605617741276744
      },
      {
        "Wort": "chip",
        "Gewicht": 0.30704118275178294
      },
      {
        "Wort": "eindeutig",
        "Gewicht": 0.1991434863232573
      }
    ]
  },
  {
    "Text": "Ein Automobilkonzern besitzt mehrere Marken. Eine Marke wird über die Markennummer eindeutig identifiziert. Ein Automobilkonzern beschäftigt mehrere Beraterfirmen. Eine Beraterfirma kann bei mehreren Automobilkonzernen beschäftigt sein.",
    "Sprache": "de",
    "keywords": [
      {
        "Wort": "automobilkonzern",
        "Gewicht": 0.41878210032886215
      },
      {
        "Wort": "bescha",
        "Gewicht": 0.41878210032886215
      },
      {
        "Wort": "ftigt",
        "Gewicht": 0.41878210032886215
      }
    ]
  },
  {
    "Text": "Schüler, die mit Name, Vorname und SchülerNr charakterisiert sind, müssen an einer Schule mehrere Präsentationen im Laufe der Schulzeit einzeln oder gemeinsam halten. Eine Präsentation kann ein oder mehrere Themen enthalten, die wiederum in verschiedenen Präsentationen vorkommen können. Präsentationen werden in verschiedenen Unterrichtsfächern gehalten und das Fach kann in verschiedenen Präsentationen vorkommen. Die Präsentationen werden von Lehrern vergeben, allerdings wird eine Präsentation von genau einem Lehrer vergeben. Um die Arbeit zu begrenzen, dürfen Schüler maximal 5 Präsentationen machen, minimal aber 3!",
    "Sprache": "de",
    "keywords": [
      {
        "Wort": "pra",
        "Gewicht": 0.5765849224600037
      },
      {
        "Wort": "sentationen",
        "Gewicht": 0.4879347117966682
      },
      {
        "Wort": "schu",
        "Gewicht": 0.2439673558983341
      }
    ]
  },
  {
    "Text": "Ein Maschinenbau-Unternehmen möchte seine Fertigung in einer zentralen Datenbank verwalten. Das Unternehmen hat verschiedene Fertigungsstraßen eingerichtet, in denen jeweils genau ein Produkt hergestellt wird. Manche Produkte werden nicht mehr hergestellt, andere sind dagegen so gefragt, dass sie sogar in mehreren Fertigungsstraßen gefertigt werden. Eine Fertigungsstraße setzt sich aus verschiedenen Fertigungsstationen zusammen. Es soll jedoch auch möglich sein, eine Fertigungsstraße zu speichern, der noch keine Fertigungsstationen zugewiesen sind. Eine Fertigungsstation gehört stets zu genau einer Fertigungsstraße. An einer Fertigungsstation arbeiten in der Regel mehrere Mitarbeiter. In der Planungsphase ist es jedoch auch möglich, dass ihr noch kein Mitarbeiter zugeordnet ist. Ein Mitarbeiter ist höchstens einer Fertigungsstation zugeordnet. In einer Fertigungsstation können für die einzelnen Arbeitsschritte Maschinen zum Einsatz kommen. Jede Maschine wird in höchstens einer Fertigungsstation verwendet werden. Maschinen, die gerade nicht in einer Fertigungsstraße eingesetzt sind, werden eingelagert, bis sie wieder in einer Fertigungsstraße benötigt bzw. verkauft oder verschrottet werden. Für jede Maschine wird außerdem erfasst, welche Mitarbeiter prinzipiell in der Lage sind, sie zu bedienen. Es besteht auch die Möglichkeit, dass eine neu angeschaffte Maschine zunächst noch von keinem Mitarbeiter bedient werden kann. Es gibt auch Mitarbeiter, die (noch) nicht in der Lage sind, eine Maschine zu bedienen. Andere wiederum haben Schulungen für verschiedene Maschinen erhalten. Für jedes Produkt soll eine Artikelnummer und eine Bezeichnung verfügbar sein. Für jede Fertigungsstraße soll ein Kürzel und eine Bezeichnung verfügbar sein. Für jede Fertigungsstation soll ein Kürzel und eine Bezeichnung verfügbar sein. Für jede Maschine soll eine Anlagennummer und eine Bezeichnung verfügbar sein. Für jeden Mitarbeiter sollen Personalnummer sowie Vor- und Nachname verfügbar sein.",
    "Sprache": "de",
    "keywords": [
      {
        "Wort": "fertigungsstation",
        "Gewicht": 0.29572578294282603
      },
      {
        "Wort": "fertigungsstraße",
        "Gewicht": 0.29572578294282603
      },
      {
        "Wort": "maschine",
        "Gewicht": 0.24643815245235504
      }
    ]
  },
  {
    "Text": "In einer Fachhochschule gibt es Dozenten (Dozentinnen sind mitgemeint), die durch Vornamen und Nachnamen genauer gekennzeichnet sind. In dieser Fachhochschule gibt es verschiedene Studienfächer, die durch ein eindeutiges Kürzel und eine lange Bezeichnung gekennzeichnet sind. An der Durchführung eines Studienfaches wirken jeweils mehrere Dozenten mit, ein einzelner Dozent wirkt an der Durchführung mehrerer Studienfächer mit. Zu jedem Studienfach gibt es genau einen Fachsprecher aus dem Kreis der Dozenten. Dozenten können Fachsprecher für mehrere Studienfächer sein.",
    "Sprache": "de",
    "keywords": [
      {
        "Wort": "dozenten",
        "Gewicht": 0.38189473761314185
      },
      {
        "Wort": "cher",
        "Gewicht": 0.32317823702172604
      },
      {
        "Wort": "studienfa",
        "Gewicht": 0.32317823702172604
      }
    ]
  },
  {
    "Text": "Das Küchenstudio „Musterküchen\" benötigt eine Datenbank, welche folgende Anforderungen erfüllen soll: Das Küchenstudio bietet verschiedene Küchenmöbel an (z.B.: Hängeschrank „Top Fred\", Hängeschrank „Herzog\", Spüle „Superclean\", ...). Jedes Küchenmöbel wird von genau einem Hersteller bezogen. Jedes Küchenmöbel hat bestimmte Abmessungen und gehört zu einer Kategorie (z.B. Hängeschrank, Spüle ...) Die Mitarbeiter des Küchenstudios verkaufen die Küchen. Küchen bestehen aus mehreren Küchenmöbeln. Ein Küchenmöbel kann in mehrere Küchen eingebaut werden. Für den Verkauf einer Küche ist jeweils ein Mitarbeiter zuständig.",
    "Sprache": "de",
    "keywords": [
      {
        "Wort": "küchenmöbel",
        "Gewicht": 0.4627223233121172
      },
      {
        "Wort": "hängeschrank",
        "Gewicht": 0.3470417424840879
      },
      {
        "Wort": "küchen",
        "Gewicht": 0.3470417424840879
      }
    ]
  },
  {
    "Text": "Jede Fluggesellschaft hat ein Kürzel, einen Namen und einen Stammsitz. Jedes Flugzeug hat eine Seriennummer, einen Hersteller, einen Typ und eine Passagierkapazität. Jeder Abflug hat eine Nummer, eine Abflugzeit (Datum und Uhrzeit) und einen Zielort. Jede Fluggesellschaft hat mindestens ein Flugzeug (seit bestimmtem Tag). Jedes Flugzeug wird von genau einer Fluggesellschaft betrieben. Für jeden Abflug wird genau ein Flugzeug eingesetzt. Flugzeuge sind (natürlich) wieder verwendbar. Jeder Flugzeugführer hat einen Namen und ein Geburtsjahr. Er hat die Berechtigung, bestimmte Flugzeugtypen zu fliegen. Jedes Flugzeug, das einer Fluggesellschaft gehört, hat mindestens einen zum Fliegen berechtigten Flugzeugführer. Für jeden Abflug braucht es einen Piloten und einen Copiloten. Die Rolle Pilot oder Copilot hängt vom Flug und nicht vom Flugzeug ab. Ein bestimmter Flugzeugführer kann je nach Flug Pilot oder Copilot sein.",
    "Sprache": "de",
    "keywords": [
      {
        "Wort": "flugzeug",
        "Gewicht": 0.41318763236459005
      },
      {
        "Wort": "einen",
        "Gewicht": 0.34783847955657915
      },
      {
        "Wort": "fluggesellschaft",
        "Gewicht": 0.3108087413973057
      }
    ]
  },
  {
    "Text": "Ein Projekt kann von mehreren Mitarbeitern bearbeitet werden, aber auch umgekehrt kann ein Mitarbeiter mehrere Projekte bearbeiten Ein Mitarbeiter arbeitet in einem Raum und umgekehrt arbeiten in jedem Raum mehrere Mitarbeiter In Niederlassung können mehrere Mitarbeiter arbeiten; umgekehrt ist aber ein Mitarbeiter einer Niederlassung als Arbeitsplatz zugeordnet Ein Kunde kann mehrere Projekte in Auftrag geben; ein Projekt kann nur von einem Kunden in Auftrag gegeben werden! Die Objekte haben folgende Attribute: Kunde(KNr), Projekt(PNr, Abgabedatum), Mitarbeiter(Name, Vorname, MNr), Niederlassung(NNr, Ort), Raum(RNr, Bezeichnung) Jedes von einem Mitarbeiter durchgeführte Projekt bekommt eine Bewertung!",
    "Sprache": "de",
    "keywords": [
      {
        "Wort": "mitarbeiter",
        "Gewicht": 0.42941052251662054
      },
      {
        "Wort": "projekt",
        "Gewicht": 0.33529570326588043
      },
      {
        "Wort": "niederlassung",
        "Gewicht": 0.2837438267405392
      }
    ]
  },
  {
    "Text": "Innerhalb eines Hotels sind die Bettenpreise einheitlich. Die Namen der Buchenden sind eindeutig oder werden durch Hinzunahme weiterer Kennzeichen (Geburtsdatum usw.) eindeutig gemacht. Eine Person kann für mehrere Termine eine Reise buchen. Jede Reise geht zu genau einem Hotel. An einem Ort können mehrere Hotels existieren. Ein Hotelname kann an verschiedenen Orten mit unterschiedlicher Hotelkategorie auftreten. Er ist aber dort eindeutig. Es treten keine gleichen Ortsnamen auf. Für jeden Ort gibt es nur eine Meereshöhenangabe.",
    "Sprache": "de",
    "keywords": [
      {
        "Wort": "hotels",
        "Gewicht": 0.27836736225787634
      },
      {
        "Wort": "reise",
        "Gewicht": 0.27836736225787634
      },
      {
        "Wort": "eindeutig",
        "Gewicht": 0.27081894927816835
      }
    ]
  },
  {
    "Text": "Ein Wissenschaftler hat einen Namen, eine Dienstadresse und ein Forschungsgebiet. Er reicht Artikel alleine oder gemeinsam mit Kollegen solange zur Veröffentlichung bei unterschiedlichen Zeitschriften ein, bis der Artikel veröffentlicht wird oder der Wissenschaftler sein Vorhaben aufgibt. Ein Artikel erscheint in höchstens einer Zeitschrift. Dabei wird ein Artikel nur veröffentlicht, wenn er zuvor von mehreren unterschiedlichen Wissenschaftlern begutachtet und für gut befunden wurde. Ein Artikel enthält gewöhnlich ein Literaturverzeichnis mit einer beliebigen Anzahl von Verweisen auf bereits früher veröffentlichte Artikel. Eine Zeitschrift wird von einem oder mehreren Wissenschaftlern herausgegeben. Ausgaben der Zeitschrift erscheinen mehrmals jährlich und jede dieser Ausgaben ist genau einem Verlag zuzuordnen. Ein Verlag kann jedoch durchaus mehrere Zeitschriften veröffentlichen, andererseits können verschiedene Ausgaben einer Zeitschrift bei verschiedenen Verlagen erscheinen.",
    "Sprache": "de",
    "keywords": [
      {
        "Wort": "artikel",
        "Gewicht": 0.49023412278599515
      },
      {
        "Wort": "zeitschrift",
        "Gewicht": 0.32682274852399673
      },
      {
        "Wort": "ausgaben",
        "Gewicht": 0.24511706139299758
      }
    ]
  },
  {
    "Text": "Die Dienstleistungsgesellschaft für Informatik (Dfl-GmbH) ist eine Bildungsein- richtung im Raum Villingen-Schwenningen (VS). Das Unternehmen hat sich auf die Abnahme von IT-Zertifizierungen spezialisiert. Zu diesem Zweck unterhält sie an verschiedenen Standorten in Villingen-Schwenningen und Umgebung eine bestimmte Anzahl an PC-Räumen (z.B.: Volkshochschule VS, 4 Räume; Bildungszentrum Schwenningen, 2 Räume; InfoPlan-Center Villingen, 1 Raum u.a.). Jeder Standort wird von einem Mitarbeiter der Dfl-GmbH organisatorisch betreut. Die Kunden der Dfl-GmbH können verschiedene IT-Zertifikate erwerben (z.B.: „Computerführerschein\"; „Open-Office-Spezialist\"; „IT Experte\" u.a.). Die Verwaltung der Zertifizierungen soll mit dem Einsatz einer Relationalen Daten- bank unterstützt werden. Für den Erwerb eines Zertifikates melden sich die Teilnehmer zu einer Prüfung an, für die eine bestimmte Gebühr zu entrichten ist. Die Prüfungen werden jeweils an einem der Standorte der Dfl-GmbH durchgeführt. Eine Zertifikatsprü- fung besteht in der Regel aus mehreren Prüfungsmodulen („Betriebssysteme\", „Textverarbeitung\", „Tabellenkalkulation\" u.a.), die innerhalb eines Tages abge- legt werden müssen. Zu beachten ist, dass einige Prüfungsmodule Bestandteil mehrerer Zertifikatsprüfungen sein können. So ist beispielsweise das Prüfungs- modul Tabellenkalkulation\" sowohl für die Zertifikatsprüfung „Open-Office- Spezialist\" als auch für den „IT-Experte\" relevant. Für jede Prüfung sollen das Prüfungsdatum, das zu erwerbende Zertifikat, die Prüfungsgebühr sowie die angemeldeten Teilnehmer mit Vorname, Nachname, E-Mail-Adresse sowie das Anmeldedatum erfasst werden. Für die Durchführung der Prüfungen ist jeweils ein Mitarbeiter der Dfl-GmbH als Prüfungsleiter verantwortlich. Für die Mitarbeiter sind der Name sowie die Anschrift mit Straße, Postleitzahl und Wohnort zu speichern. Von den Standorten sind die Bezeichnung, die Anschrift mit Strasse, Postleitzahl und Ort sowie die Anzahl der PC-Räume zu speichern.",
    "Sprache": "de",
    "keywords": [
      {
        "Wort": "die",
        "Gewicht": 0.2814960632085884
      },
      {
        "Wort": "dfl",
        "Gewicht": 0.26291831302684254
      },
      {
        "Wort": "gmbh",
        "Gewicht": 0.26291831302684254
      }
    ]
  },
  {
    "Text": "Für jedes Vereinsmitglied werden neben einer eindeutigen Mitgliedsnummer auch Name und Eintrittsdatum gespeichert. Musiker sind besondere Vereinsmitglieder, die Instrumente spielen können. Ein Instrument besitzt eine eindeutige Bezeichnung und mehrere Zubehörteile. Ein Musiker kann beliebig viele Instrumente spielen und ein Instrument kann von beliebig vielen Musikern gespielt werden. Außerdem kann ein Musiker beliebig viele Musikstücke komponieren; ein Musikstück besitzt einen eindeutigen Titel und wird von genau einem Musiker komponiert. Chorleiter sind besondere Musiker, die eine gewisse Anzahl an Chorjahren aufweisen. Weiterhin gibt es Performances, die jeweils eine Startzeit, eine Endzeit sowie einen eindeutigen Titel besitzen und von genau einem Chorleiter geleitet werden. Jeder Chorleiter kann allerdings beliebig viele Performances leiten. An einer Performance nimmt mindestens ein Musiker teil. Jeder Musiker kann an beliebig vielen Perfor- mances teilnehmen. Es gibt außerdem Veranstaltungen, die eindeutig über ihre jeweiligen Bezeichnungen identifizierbar sind und jeweils ein Datum und einen Ort besitzen. Ein Musikstück wird im Rahmen einer Performance auf einer Ver- anstaltung aufgeführt. Eine Performance wird dabei nur genau einmal aufgeführt. Jede Veranstaltung umfasst mindestens eine und maximal fünf Performances. Ein Musikstück kann beliebig oft aufgeführt werden. Eine Veranstaltung wird von mindestens einem Vereinsmitglied organisiert und von beliebig vielen Vereinsmit- gliedern besucht. Jedes Vereinsmitglied kann beliebig viele Veranstaltungen organisieren und auch beliebig viele Veranstaltungen besuchen.",
    "Sprache": "de",
    "keywords": [
      {
        "Wort": "beliebig",
        "Gewicht": 0.4568761622112123
      },
      {
        "Wort": "musiker",
        "Gewicht": 0.3553481261642762
      },
      {
        "Wort": "musikstu",
        "Gewicht": 0.2030560720938721
      }
    ]
  },
  {
    "Text": "Ein Zeitschriftenvertrieb hat viele unterschiedliche Zeitungen im Angebot. Die Kun- den sind keine Privatleute, sondern Einzelhandelsgescha ̈fte, die Zeitungen in ihrem Sortiment fu ̈hren. Jeden Morgen wird jeder Kunde mit den gewu ̈nschten Zeitungen beliefert. Welche Zeitungen zu liefern sind, ist in einem Vertrag geregelt. Es gibt Zeitschriften mit unterschiedlichen Erscheinungszeitra ̈umen (täglich, wöchentlich, 14-tägig, monatlich, 2-monatlich und 1/4-jährlich). Nicht verkaufte Zeitschriften kann der Händler wieder zurückgeben. Lieferscheine werden täglich erstellt. Die Rücknahmen werden täglich verbucht. Die Rechnungen werden monatlich erstellt. Rückstände werden monatlich angemahnt.",
    "Sprache": "de",
    "keywords": [
      {
        "Wort": "monatlich",
        "Gewicht": 0.4082334466745051
      },
      {
        "Wort": "zeitungen",
        "Gewicht": 0.4082334466745051
      },
      {
        "Wort": "täglich",
        "Gewicht": 0.30617508500587887
      }
    ]
  },
  {
    "Text": "Es gibt Krankenhäuser, die eine eindeutige Krankenhausnummer haben, einen Namen, eine Anschrift und eine feste Anzahl Betten. Krankenhäuser beschäftigen Ärzte. Diese haben einen Namen, eine Personalnummer, eine Adresse und ein Fachgebiet. Ein Arzt betreut mehrere Patienten. Ein Patient hat einen Namen, ein Geschlecht, eine Adresse, ein Geburtsdatum, eine Station und eine Patientennummer. Es gibt ausserdem unabhängige Labore mit eindeutiger Labornummer,Namen, Anschrift und Telefonnummer. Labore werden von Krankenhäusern beauftragt. In Laboren werden Tests durchgeführt. Diese Tests haben einen Testcode,einen Typ, einen Status und ein Datum. Tests werden an Proben von Patienten durchgeführt. Krankenhäuser beschäftigen auch Krankenschwestern und Krankenpfleger. Diese haben einen Namen, eine Adresse, ein Geschlecht, eine Station, ein Alter und eine Personalnummer. Die Zimmer eines Krankenhauses haben eine Zimmernummer und eine Bettenzahl. Eine Krankenschwester ist immer für mehrere Zimmer zuständig. Auf jedem Krankenzimmer liegen mehrere Patienten. Patienten leiden an einer oder mehreren Krankheiten. Eine Krankheit hat einen Namen, Symptome und einen Status. Patienten nehmen mehrere Medikamente. Ein Medikament hat einen Namen, einen Preis, einen Bestand und einen Lieferanten.",
    "Sprache": "de",
    "keywords": [
      {
        "Wort": "einen",
        "Gewicht": 0.4193288781568496
      },
      {
        "Wort": "patienten",
        "Gewicht": 0.3242496701891453
      },
      {
        "Wort": "eine",
        "Gewicht": 0.28356669874291374
      }
    ]
  },
  {
    "Text": "Ein Geschäft hat viele Filialen. Jede Filiale darf von höchstens einem Filialleiter geführt werden. Ein Filialleiter darf höchstens zwei Filialen leiten. Ohne eine Filiale wird kein Filialleiter bestimmt. Die Filiale bietet viele Produkte an. Das Produkt wird von vielen Filialen angeboten. Die Filiale beschäftigt viele Mitarbeiter. Ein Mitarbeiter darf höchstens einen Verkauf bearbeiten. Im Verkauf können viele Produkte involviert sein. Jedes Produkt enthält Preis, Produktname und eindeutige Produkt-ID. Es gibt zwei spezielle Produkttypen: Neuwaren, bei denen die Verpackungsnummer registriert ist. Bei Gebrauchtwaren wird die Anzahl der Vorbesitzer mitgeführt. Eine Filiale wird durch die Filial-ID eindeutig identifiziert. Die Filiale hat einen Filialnamen, eine Filialadresse und eine Telefonnummer. Verkauf enthält Datum, Uhrzeit und Betrag. Jeder Mitarbeiter hat einen Mitarbeiternamen bestehend aus Vorname und Nachname, eine oder mehrere Mitarbeiteradressen und eine Telefonnummer. Die Mitarbeiter und der Filialleiter werden durch eine ID identifiziert.",
    "Sprache": "de",
    "keywords": [
      {
        "Wort": "filiale",
        "Gewicht": 0.4361708916469502
      },
      {
        "Wort": "filialleiter",
        "Gewicht": 0.29078059443130017
      },
      {
        "Wort": "darf",
        "Gewicht": 0.2180854458234751
      }
    ]
  },
  {
    "Text": "Mehrere in ganz Deutschland verteilte Zoos sollen mittels einer Datenbank verwaltet werden. Jeder Zoo (eindeutige Identifikationsnummer, Name und Ort) hat mehrere Tierarten (bezeichnet durch ihren Namen). Diese Tierarten werden von mehreren Pflegern (Personalnummer, Name, Geburtsdatum, Gehalt) gepflegt und befinden sich in jeweils einem ihnen zugeteilten Raum (Raum-Nummer, Fläche). Als Raum werden hier auch Außengehege bezeichnet. Von jeder Tierart gibt es einige Exemplare (eindeutige Tier-Nummer, Alter, Geschlecht). Jedes Tier bekommt eine spezielle Futtermischung (eindeutige Nummer, Bezeichnung), welche aus verschiedenen Futtermitteln (eindeutige Nummer, Name) hergestellt wird. Die Futtermittel werden von Lieferanten (eindeutige Lieferanten-Nummer, Name, Adresse) geliefert und in Lagern (eindeutige Lager-Nummer, Kapazität) aufbewahrt.",
    "Sprache": "de",
    "keywords": [
      {
        "Wort": "nummer",
        "Gewicht": 0.4567210772240584
      },
      {
        "Wort": "eindeutige",
        "Gewicht": 0.3677217974153034
      },
      {
        "Wort": "raum",
        "Gewicht": 0.210616565167141
      }
    ]
  },
  {
    "Text": "Eine Station hat einen Namen und eine Nummer. Eine Zugverbindung fährt ohne Halt von einer Station zu einer anderen. Zugverbindungen haben eine Abfahrtszeit, eine Ankunftszeit und einen (Abfahrts)tag. Verbindungen können von mehreren Zügen genutzt werden. Züge Nahverkehrs- und Fernzüge sind Züge und bestehen aus Wagen, die wiederum Plätze enthalten. Nahverkehrs- und Fernzüge (Züge) haben jeweils eindeutige Nummern. Fernzüge haben Namen und manchmal Speisewagen als besondere Wagen. Jeder Platz hat eine Nummer und eine Klasse. Zusätzlich wird festgehalten, ob es ein Raucherplatz und/oder ein Fensterplatz ist. Jeder Wagen hat eine eindeutige Nummer. Tickets und Reservierungen Ein Ticket gilt für eine oder mehrere Verbindungen und hat einen Preis und eine Ticketnummer. Für Tickets können ein oder mehrere Aufschläge / Rabatte berechnet werden Ein Aufschlag oder Rabatt hat einen Namen, einen Betrag und eine Einheit. Ein Aufschlag oder Rabatt kann einen anderen oder mehrere ausschließen.",
    "Sprache": "de",
    "keywords": [
      {
        "Wort": "und",
        "Gewicht": 0.2961504647086453
      },
      {
        "Wort": "eine",
        "Gewicht": 0.25130765379270026
      },
      {
        "Wort": "oder",
        "Gewicht": 0.24536715197624712
      }
    ]
  },
  {
    "Text": "In einigen Sportarten werden auch eine oder mehrere Mannschaften gestellt, die an Wettbe­werben teilnehmen. Die Mannschaften setzen sich aus Mitgliedern des Vereins zusammen. Vereinsmitglieder müssen nicht zu einer Mannschaft gehören, können aber auch zu mehreren Mannschaften gehören. Die einzelnen Mannschaften werden genau von einem Mitglied betreut. Ein Mitglied kann auch mehrere Mannschaften betreuen. Es gibt verschiedene Sportstätten, die durch ihren Namen und ihre Adresse beschrieben wer­den. Die einzelnen Mannschaften trainieren in verschiedenen Sportstätten zu bestimmten Trai­ningszeiten (Wochentag, Trainingszeit). Dabei kann für jede Mannschaft die Sportstätte wechseln.",
    "Sprache": "de",
    "keywords": [
      {
        "Wort": "mannschaften",
        "Gewicht": 0.6090823428770882
      },
      {
        "Wort": "gehören",
        "Gewicht": 0.20302744762569608
      },
      {
        "Wort": "mannschaft",
        "Gewicht": 0.20302744762569608
      }
    ]
  },
  {
    "Text": "Eine KFZ-Zulassungsstelle in einem Landkreis möchte Informationen über die bei ihr zugelassenen KFZ und ihre Eigentümer speichern. Dabei interessieren folgende Informationen: Von den Eigentümern der KFZ werden Name, Vorname, Geburtsdatum und die Postanschrift mit Straße, Ort und PLZ benötigt. Von den zugelassenen Fahrzeugen wird die Fahrgestellnummer und das Baujahr verzeichnet. Außerdem werden die Fahrzeuge in Typklassen eingeordnet. Jeder Fahrzeugtyp hat einen Typcode, die Angabe des Herstellers, des Modells und der Schadstoffklasse. Bei der Zulassung eines Fahrzeugs wird das Kennzeichen vergeben. Die Zulassung findet zu einem bestimmten Datum statt. Ein Fahrzeug kann auch abgemeldet werden, dann wird das Abmeldedatum verzeichnet. Ein Fahrzeug kann erst einen Tag nach der Zulassung wieder abgemeldet werden.",
    "Sprache": "de",
    "keywords": [
      {
        "Wort": "zulassung",
        "Gewicht": 0.2933113413793216
      },
      {
        "Wort": "kfz",
        "Gewicht": 0.25995111580057695
      },
      {
        "Wort": "abgemeldet",
        "Gewicht": 0.19554089425288104
      }
    ]
  },
  {
    "Text": "Eine Hochschule bietet Veranstaltungen an, die an einem bestimmten Wochentag und einem bestimmten Block in einem bestimmten Raum stattfinden. Jede dieser Veranstaltungen wird von genau einem Dozenten angeboten, von dem Name und Vorname bekannt sind. Ein Modul beschreibt die Veranstaltungen, die angeboten werden. Für jeden Modul gibt es eine eindeutige Modulnummer, eine Bezeichnung und die Zahl der CreditPoints, die nach erfolgreichem Absolvieren den Studierenden zugerechnet werden. Studierende besuchen Veranstaltungen. Studierende haben einen Namen und Vornamen, sowie eine eindeutige Matrikelnummer.",
    "Sprache": "de",
    "keywords": [
      {
        "Wort": "veranstaltungen",
        "Gewicht": 0.44517649565400547
      },
      {
        "Wort": "bestimmten",
        "Gewicht": 0.279900247650562
      },
      {
        "Wort": "studierende",
        "Gewicht": 0.2511535961072652
      }
    ]
  },
  {
    "Text": "Ein Bier hat Name und Hersteller. Eine Bar hat einen Namen, Adresse und Lizenz. Und schenkt bestimmte Biere aus. Ein Trinker hat Name und Adresse. Und besucht Bars. Und mag Biere. Ein Trinker kann ein Lieblingsbier haben. Zusätzlich: Ein Hersteller hat einen Bestseller.",
    "Sprache": "de",
    "keywords": [
      {
        "Wort": "biere",
        "Gewicht": 0.3352778250189654
      },
      {
        "Wort": "trinker",
        "Gewicht": 0.3352778250189654
      },
      {
        "Wort": "und",
        "Gewicht": 0.31673689624053925
      }
    ]
  },
  {
    "Text": "Ein LKW wird von einem Fahrer gefahren. Das Unternehmen unterhält mehrere Werkstätten zur Reparatur der LKW. In jeder Werkstatt werden mehrere LKW repariert, aber jeder LKW hat eine ihm fest zugewiesene Werkstatt. Die Mechaniker, die einer Werkstatt jeweils fest zugeordnet sind, können verschiedene Reparaturarbeiten durchführen. Bei vielen Reparaturarbeiten besitzen auch mehrere Mechaniker in der jeweiligen Werkstatt die Fähigkeit, diese durchzuführen.",
    "Sprache": "de",
    "keywords": [
      {
        "Wort": "lkw",
        "Gewicht": 0.46340202877241254
      },
      {
        "Wort": "werkstatt",
        "Gewicht": 0.46340202877241254
      },
      {
        "Wort": "fest",
        "Gewicht": 0.23170101438620627
      }
    ]
  },
  {
    "Text": "Ein Flugzeug hat einen bestimmten Typ, wie z.B. „A340-400“, ein Kennzeichen, das es identifiziert, wie „D-AGHT“, ein Baujahr und eine Anzahl von Sitzplätzen. Flugzeuge legen Flugstrecken zurück. Jede Flugstrecke hat eine Flugnummer, wie z.B. „LH-353“. Die Flugnummer bezeichnet den Flug der Flugstrecke mitsamt seiner Abflugzeit. Der Flug der Strecke wird somit durch die Flugnummer und den Tag der Flugs eindeutig festgelegt. Flugstrecken führen von einem Startflughafen zu einem Zielflughafen, haben eine bestimmte Dauer und eine bestimmte Strecke in Meilen. Passagiere haben einen Namen und Vornamen. Sie buchen Flugstrecken. Frequent Flyers sind Passagiere, die häufig fliegen und am Prämienprogramm teilnehmen. Sie haben ein Meilenkonto mit einer eindeutigen Kontonummer. Über jeden Frequent Flyer ist bekannt, wieviele Prämienmeilen er bisher angesammelt hat.",
    "Sprache": "de",
    "keywords": [
      {
        "Wort": "flugnummer",
        "Gewicht": 0.2774330299505322
      },
      {
        "Wort": "flugstrecken",
        "Gewicht": 0.2774330299505322
      },
      {
        "Wort": "wie",
        "Gewicht": 0.24587874903312593
      }
    ]
  }
]